## DataFrame And Series in pandas

In [5]:
import pandas as pd

In [20]:
data = [[1,'shubham' , 'E&TC'],[2,'maddy' ,'CS'] , [3,'nishad' , 'BCS'] , [4,'omk' , 'CS']]

In [23]:
cols = ['UserID', 'Name' , 'Branch']

In [24]:
df = pd.DataFrame(data = data , columns = cols).set_index('UserID')

In [25]:
df

           Name Branch
UserID
1       shubham   E&TC
2         maddy     CS
3        nishad    BCS
4           omk     CS

In [26]:
s = ps.Series([7.9 , 8.2 , 6.98 , 8.62])

In [29]:
pd.concat([df,s] , axis = 1).

      Name Branch     0
0      NaN    NaN  7.90
1  shubham   E&TC  8.20
2    maddy     CS  6.98
3   nishad    BCS  8.62
4      omk     CS   NaN